README.org
#+title: ATPL Language and rules
#+author: Luca Zaninotto -- 2057074
#+options: toc:nil num:nil
#+latex_header: \usepackage{proof}
#+latex_header: \usepackage{mathtools}
#+latex_header: \newcommand{\Lang}{\ensuremath{\mathcal{L}}}
#+latex_header: \newcommand{\fn}[2]{\ensuremath{\text{fn}\; #1 \; . \; #2}}
#+latex_header: \newcommand{\ifc}[3]{\ensuremath{\text{if } #1 \text{ then } #2 \text{ else } #3}}
#+latex_header: \newcommand{\app}[2]{\ensuremath{ #1 \; #2}}
#+latex_header: \newcommand{\fv}[1]{\ensuremath{\text{fv}\left( #1 \right)}}
#+latex_header: \newcommand{\true}{\ensuremath{\mbox{true}}}
#+latex_header: \newcommand{\false}{\ensuremath{\mbox{false}}}
#+latex_header: \newcommand{\Bool}{\ensuremath{\mbox{Bool}}}
#+latex_header: \newcommand{\Nat}{\ensuremath{\mbox{Nat}}}
#+latex_header: \newcommand{\unit}{\ensuremath{\mbox{unit}}}
#+latex_header: \newcommand{\Unit}{\ensuremath{\mbox{Unit}}}
#+latex_header: \newcommand{\inferr}[3]{\ensuremath{\infer[\text{\small{(#1)}}]{#2}{#3}}}
#+latex_header: \newcommand{\subs}[2]{\ensuremath{\{ #1 := #2 \}}}
#+latex_header: \newcommand{\type}[2]{\ensuremath{ #1 : #2 }}
#+latex_header: \newcommand{\Dom}{\ensuremath{\mbox{Dom}}}
#+latex_header: \newcommand{\pair}[2]{\ensuremath{( #1 , #2 )}}
#+latex_header: \newcommand{\fst}[1]{\ensuremath{ #1 . \__1}}
#+latex_header: \newcommand{\snd}[1]{\ensuremath{ #1 . \__2}}
#+latex_header: \newcommand{\rec}[1]{\ensuremath{ \{ #1 \} }}
#+latex_header: \newcommand{\sel}[2]{\ensuremath{ #1 . #2 }}
#+latex_header: \newcommand{\var}[1]{\ensuremath{ \langle #1 \rangle }}
#+latex_header: \newcommand{\match}[2]{\ensuremath{ #1 \texttt{ match }\{ #2 \} }}
#+latex_header: \newcommand{\case}[3]{\ensuremath{ \texttt{case } #1 = #2 \Rightarrow #3}}
#+latex_header: \newcommand{\subt}[2]{\ensuremath{ #1 <: #2 }}
#+latex_header: \newcommand{\throw}[1]{\ensuremath{\texttt{throw } #1}}
#+latex_header: \newcommand{\tc}[2]{\ensuremath{\texttt{try } #1 \texttt{ catch } #2}}
#+latex_header: \let\emptyset\varnothing
* Language
  \(\Lang\) language is inductively defined by means of the following
  grammar:
  
  |         <r> |   <c>    | <l>                            | <l>                           |
  | Terms \(M\) | \(::=\)  | \(x\)                          | variables                     |
  |             | \(\mid\) | \(n \mid\) true \(\mid\) false | integer and boolean constants |
  |             | \(\mid\) | \(M + M\)                      | addition operation            |
  |             | \(\mid\) | if \(M\) then \(M\) else \(M\) | conditional operation         |
  |             | \(\mid\) | \(\fn{x}{M}\)                  | function declaration          |
  |             | \(\mid\) | \(\app{M}{M}\)                 | function application          |

** Free variables
   Given a term \(M\), the set of free variables of \(M\) written
   \(\fv{M}\)are inductively defined as follows:

   |                                  <r> | <c> | <l>                                      |
   |                           \(\fv{x}\) |  =  | \(\{x\}\)                                |
   | \(\fv{n} = \fv{\false} = \fv{true}\) |  =  | \(\emptyset\)                            |
   |                       \(\fv{M + N}\) |  =  | \(\fv{M} \cup \fv{N}\)                   |
   |         \(\fv{\ifc{M_1}{M_2}{M_3}}\) |  =  | \(\fv{M_1} \cup \fv{M_2} \cup \fv{M_3}\) |
   |                   \(\fv{\fn{x}{M}}\) |  =  | \(\fv{M} \setminus \{x\}\)               |
   |                  \(\fv{\app{M}{N}}\) |  =  | \(\fv{M}\cup\fv{N}\)                     |

* Operational Semantics
  Defines the smallest binary relation between the terms of \(\Lang\)
  that satisfies the following axioms and inference rules
** Values
   Subset of term corresponding to the possible final states of the
   computation, i.e.the results of the program evaluation/execution.
   #+attr_latex: :align rcll
   | Values \(v\) | \(::=\)  | \(n \mid\) true \(\mid\) false | integer and boolean constat |
   |              | \(\mid\) | \(\fn{x}{M}\)                  | function declaration        |

** Axioms
   | \(\inferr{SUM}{n_1 + n_2 \to n}{}\)                        |
   |                                                            |
   | \(\inferr{IF-TRUE}{\ifc{\true}{M}{N} \to M}{}\)            |
   |                                                            |
   | \(\inferr{IF-FALSE}{\ifc{\false}{M}{N} \to N}{}\)          |
   |                                                            |
   | \(\inferr{BETA}{\app{(\fn{x}{M})}{v} \to M\subs{x}{v}}{}\) |
   
** Rules
   | \(\inferr{IF}{\ifc{M_1}{M_2}{M_3} \to \ifc{M_1'}{M_2}{M_3}}{M_1 \to M_1'}\) |
   |                                                                             |
   | \(\inferr{SUM LEFT}{M + N \to M' + N}{M \to M'}\)                           |
   |                                                                             |
   | \(\inferr{SUM RIGHT}{v + M \to v + M'}{M \to M'}\)                          |
   |                                                                             |
   | \(\inferr{APP 1}{\app{M}{N} \to \app{M'}{N}}{M \to M'}\)                    |
   |                                                                             |
   | \(\inferr{APP 2}{\app{v}{M} \to \app{v}{M'}}{M \to M'}\)                    |

   App 1, App 2 e Beta, tutte assieme impostano la convenzione
   call-by-value, dove prima di eseguire una funzione su dei
   parametri, questi vengono valutati, producendo eventualmente stuck
   term /prima/ della chiamata a funzione
* Typing
  Types are needed to /classify/ values, which in the language are
  constants, integers, booleans and functions:
  #+attr_latex: :align rcll
  | Types \(T\) | \(::=\)  | Bool       | type of boolean values |
  |             | \(\mid\) | Nat        | type of integer values |
  |             | \(\mid\) | \(T\to T\) | type of functions      |
** Axioms
   |                          <c>                           |                           <c>                           |
   | \(\inferr{T-TRUE}{\Gamma\vdash\type{\true}{\Bool}}{}\) | \(\inferr{T-FALSE}{\Gamma\vdash\type{\true}{\Bool}}{}\) |
   |                                                        |                                                         |
   |    \(\inferr{T-INT}{\Gamma\vdash\type{n}{\Nat}}{}\)    |      \(\inferr{T-VAR}{\Gamma\vdash\type{x}{T}}{}\)      |

** Rules
   |                                                                             <c>                                                                             |
   |                         \(\inferr{T-SUM}{\Gamma\vdash\type{(M+N)}{\Nat}}{\Gamma\vdash\type{M}{\Nat} & \Gamma\vdash\type{N}{\Nat}}\)                         |
   |                                                                                                                                                             |
   | \(\inferr{T-IFTHENELSE}{\Gamma\vdash\type{\ifc{M_1}{M_2}{M_3}}{T}}{\Gamma\vdash\type{M_1}{\Bool} & \Gamma\vdash\type{M_2}{T} & \Gamma\vdash\type{M_3}{T}}\) |
   |                                                                                                                                                             |
   |                    \(\inferr{T-FUN}{\Gamma\vdash\type{\fn{\type{x}{T_1}}{M}}{T_1 \to T_2}}{\Gamma, \type{x}{T_1}\vdash \type{M}{T_2}}\)                     |
   |                                                                                                                                                             |
   |                    \(\inferr{T-APP}{\Gamma\vdash\type{\app{M}{N}}{T_2}}{\Gamma\vdash\type{M}{T_1 \to T_2} & \Gamma\vdash\type{N}{T_1}}\)                    |

** Lemmas
   
