README.tex
% Created 2023-07-03 lun 17:01
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{proof}
\usepackage{mathtools}
\newcommand{\Lang}{\ensuremath{\mathcal{L}}}
\newcommand{\fn}[2]{\ensuremath{\text{fn}\; #1 \; . \; #2}}
\newcommand{\ifc}[3]{\ensuremath{\text{if } #1 \text{ then } #2 \text{ else } #3}}
\newcommand{\app}[2]{\ensuremath{ #1 \; #2}}
\newcommand{\fv}[1]{\ensuremath{\text{fv}\left( #1 \right)}}
\newcommand{\true}{\ensuremath{\mbox{true}}}
\newcommand{\false}{\ensuremath{\mbox{false}}}
\newcommand{\Bool}{\ensuremath{\mbox{Bool}}}
\newcommand{\Nat}{\ensuremath{\mbox{Nat}}}
\newcommand{\unit}{\ensuremath{\mbox{unit}}}
\newcommand{\Unit}{\ensuremath{\mbox{Unit}}}
\newcommand{\inferr}[3]{\ensuremath{\infer[\text{\small{(#1)}}]{#2}{#3}}}
\newcommand{\subs}[2]{\ensuremath{\{ #1 := #2 \}}}
\newcommand{\type}[2]{\ensuremath{ #1 : #2 }}
\newcommand{\Dom}{\ensuremath{\mbox{Dom}}}
\newcommand{\pair}[2]{\ensuremath{( #1 , #2 )}}
\newcommand{\fst}[1]{\ensuremath{ #1 . \__1}}
\newcommand{\snd}[1]{\ensuremath{ #1 . \__2}}
\newcommand{\rec}[1]{\ensuremath{ \{ #1 \} }}
\newcommand{\sel}[2]{\ensuremath{ #1 . #2 }}
\newcommand{\var}[1]{\ensuremath{ \langle #1 \rangle }}
\newcommand{\match}[2]{\ensuremath{ #1 \texttt{ match }\{ #2 \} }}
\newcommand{\case}[3]{\ensuremath{ \texttt{case } #1 = #2 \Rightarrow #3}}
\newcommand{\subt}[2]{\ensuremath{ #1 <: #2 }}
\newcommand{\throw}[1]{\ensuremath{\texttt{throw } #1}}
\newcommand{\tc}[2]{\ensuremath{\texttt{try } #1 \texttt{ catch } #2}}
\let\emptyset\varnothing
\author{Luca Zaninotto -- 2057074}
\date{\today}
\title{ATPL Language and rules}
\hypersetup{
 pdfauthor={Luca Zaninotto -- 2057074},
 pdftitle={ATPL Language and rules},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section*{Language}
\label{sec:org80f7a7a}
\(\Lang\) language is inductively defined by means of the following
grammar:

\begin{center}
\begin{tabular}{rcll}
Terms \(M\) & \(::=\) & \(x\) & variables\\
 & \(\mid\) & \(n \mid\) true \(\mid\) false & integer and boolean constants\\
 & \(\mid\) & \(M + M\) & addition operation\\
 & \(\mid\) & if \(M\) then \(M\) else \(M\) & conditional operation\\
 & \(\mid\) & \(\fn{x}{M}\) & function declaration\\
 & \(\mid\) & \(\app{M}{M}\) & function application\\
\end{tabular}

\end{center}

\subsection*{Free variables}
\label{sec:org8728f7c}
Given a term \(M\), the set of free variables of \(M\) written
\(\fv{M}\)are inductively defined as follows:

\begin{center}
\begin{tabular}{rcl}
\(\fv{x}\) & = & \(\{x\}\)\\
\(\fv{n} = \fv{\false} = \fv{true}\) & = & \(\emptyset\)\\
\(\fv{M + N}\) & = & \(\fv{M} \cup \fv{N}\)\\
\(\fv{\ifc{M_1}{M_2}{M_3}}\) & = & \(\fv{M_1} \cup \fv{M_2} \cup \fv{M_3}\)\\
\(\fv{\fn{x}{M}}\) & = & \(\fv{M} \setminus \{x\}\)\\
\(\fv{\app{M}{N}}\) & = & \(\fv{M}\cup\fv{N}\)\\
\end{tabular}

\end{center}

\section*{Operational Semantics}
\label{sec:org39a16a6}
Defines the smallest binary relation between the terms of \(\Lang\)
that satisfies the following axioms and inference rules
\subsection*{Values}
\label{sec:org9c2b509}
Subset of term corresponding to the possible final states of the
computation, i.e.the results of the program evaluation/execution.
\begin{center}
\begin{tabular}{rcll}
Values \(v\) & \(::=\) & \(n \mid\) true \(\mid\) false & integer and boolean constat\\
 & \(\mid\) & \(\fn{x}{M}\) & function declaration\\
\end{tabular}

\end{center}

\subsection*{Axioms}
\label{sec:orgccb51ad}
\begin{center}
\begin{tabular}{l}
\(\inferr{SUM}{n_1 + n_2 \to n}{}\)\\
\\
\(\inferr{IF-TRUE}{\ifc{\true}{M}{N} \to M}{}\)\\
\\
\(\inferr{IF-FALSE}{\ifc{\false}{M}{N} \to N}{}\)\\
\\
\(\inferr{BETA}{\app{(\fn{x}{M})}{v} \to M\subs{x}{v}}{}\)\\
\end{tabular}

\end{center}

\subsection*{Rules}
\label{sec:orgd0a06e1}
\begin{center}
\begin{tabular}{l}
\(\inferr{IF}{\ifc{M_1}{M_2}{M_3} \to \ifc{M_1'}{M_2}{M_3}}{M_1 \to M_1'}\)\\
\\
\(\inferr{SUM LEFT}{M + N \to M' + N}{M \to M'}\)\\
\\
\(\inferr{SUM RIGHT}{v + M \to v + M'}{M \to M'}\)\\
\\
\(\inferr{APP 1}{\app{M}{N} \to \app{M'}{N}}{M \to M'}\)\\
\\
\(\inferr{APP 2}{\app{v}{M} \to \app{v}{M'}}{M \to M'}\)\\
\end{tabular}

\end{center}

App 1, App 2 e Beta, tutte assieme impostano la convenzione
call-by-value, dove prima di eseguire una funzione su dei
parametri, questi vengono valutati, producendo eventualmente stuck
term \emph{prima} della chiamata a funzione
\section*{Typing}
\label{sec:orgdbd310c}
Types are needed to \emph{classify} values, which in the language are
constants, integers, booleans and functions:
\begin{center}
\begin{tabular}{rcll}
Types \(T\) & \(::=\) & Bool & type of boolean values\\
 & \(\mid\) & Nat & type of integer values\\
 & \(\mid\) & \(T\to T\) & type of functions\\
\end{tabular}

\end{center}
\subsection*{Axioms}
\label{sec:orgdd0e9dd}
\begin{center}
\begin{tabular}{cc}
\(\inferr{T-TRUE}{\Gamma\vdash\type{\true}{\Bool}}{}\) & \(\inferr{T-FALSE}{\Gamma\vdash\type{\true}{\Bool}}{}\)\\
 & \\
\(\inferr{T-INT}{\Gamma\vdash\type{n}{\Nat}}{}\) & \(\inferr{T-VAR}{\Gamma\vdash\type{x}{T}}{}\)\\
\end{tabular}

\end{center}

\subsection*{Rules}
\label{sec:orge75cab7}
\begin{center}
\begin{tabular}{c}
\(\inferr{T-SUM}{\Gamma\vdash\type{(M+N)}{\Nat}}{\Gamma\vdash\type{M}{\Nat} & \Gamma\vdash\type{N}{\Nat}}\)\\
\\
\(\inferr{T-IFTHENELSE}{\Gamma\vdash\type{\ifc{M_1}{M_2}{M_3}}{T}}{\Gamma\vdash\type{M_1}{\Bool} & \Gamma\vdash\type{M_2}{T} & \Gamma\vdash\type{M_3}{T}}\)\\
\\
\(\inferr{T-FUN}{\Gamma\vdash\type{\fn{\type{x}{T_1}}{M}}{T_1 \to T_2}}{\Gamma, \type{x}{T_1}\vdash \type{M}{T_2}}\)\\
\\
\(\inferr{T-APP}{\Gamma\vdash\type{\app{M}{N}}{T_2}}{\Gamma\vdash\type{M}{T_1 \to T_2} & \Gamma\vdash\type{N}{T_1}}\)\\
\end{tabular}

\end{center}
