README.org
*** Inversion lemma(s)
    1. If \(\Gamma\vdash\type{\true}{T}\) is derivable, then \(T = \Bool\)
    2. If \(\Gamma\vdash\type{\false}{T}\) is derivable, then \(T = \Bool\)
    3. If \(\Gamma\vdash\type{n}{T}\) is derivable, then \(T = \Nat\)
    4. If \(\Gamma\vdash\type{M+N}{T}\) is derivable, then \(T = \Nat
       \) and \(\Gamma \vdash \type{M}{\Nat}\),
       \(\Gamma\vdash\type{N}{\Nat}\) are derivable.
    5. If \(\Gamma\vdash\type{\ifc{M_1}{M_2}{M_3}}{T}\) is derivable,
       then \(\Gamma\vdash\type{M_1}{\Bool}\),
       \(\Gamma\vdash\type{M_2}{T}\), \(\Gamma\vdash\type{M_3}{T}\)
       are derivable judgments
    6. If \(\Gamma\vdash\type{x}{T}\) is derivable, then \(\type{x}{T}
       \in \Gamma\)
    7. If \(\Gamma\vdash\type{\fn{\type{x}{T_1}}{M}}{T}\) is
       derivable, then \(\exists T_2\) s.t. \(T = T_1 \to T_2\) and
       \(\Gamma, \type{x}{T_1}\vdash \type{M}{T_2}\) is a derivable
       judgment.
    8. If \(\Gamma\vdash\type{\app{M}{N}}{T}\) is derivable, then
       \(\exists T_1\) s.t. \(\Gamma\vdash\type{M}{T_1\to T_2}\) and
       \(\Gamma\vdash\type{N}{T_1}\) are derivable judgments.
    9. If \(\Gamma\vdash \type{\unit}{T}\) then \(T = \Unit\)
    10. If \(\Gamma\vdash \type{\pair{M_1}{M_2}}{T}\) is derivable,
        then \(\exists T_1, T_2 \mid \Gamma\vdash \type{M_1}{T_1}
        \quad \Gamma\vdash \type{M_2}{T_2}\) are derivable.
    11. If \(\Gamma\vdash \type{\fst{M}}{T}\) is derivable, then
        \(\exists T_1 \mid \Gamma\vdash \type{M}{T * T_1}\) is
        derivable.
    12. If \(\Gamma\vdash \type{\snd{M}}{T}\) is derivable, then
        \(\exists T_1 \mid \Gamma\vdash \type{M}{T_1 * T}\) is
        derivable.
    13. If \(\Gamma\vdash \type{\rec{\ell_i = M_i \quad^{i\in 1\dots
        n}}} {T}\) is derivable, then \(\forall i \in 1 \dots n \quad
        \exists T_i \mid \Gamma\vdash \type{M_i}{T_i}\) and \(T =
        \rec{\type{\ell_i}{T_i}\quad^{i \in 1\dots n}}\)
    14. If \(\Gamma\vdash \type{\sel{M}{\ell_j}}{T}\) is derivable,
        then \(\exists n \mid \forall i \in 1\dots n\quad \exists
        \ell_i, T_i \mid \Gamma\vdash \type{M}{\rec{\type{\ell_i}{T_i}
        \quad^{i \in 1\dots n}}}\) and \(T = T_j\).

**** Inversion lemma with subtyping
     We have to add
     1. If \(\Gamma \vdash \type{x}{T}\) then \(\exists x \mid
        \type{x}{S}\) and \(\subt{S}{T}\)
     2. If \(\Gamma\vdash\type{\fn{\type{x}{S_1}}{M}}{T}\) is
        derivable, then \(\exists T_1, T_2 \mid T = T_1 \to T_2\) with
        \(\subt{T_1}{S_1}\) and \(\Gamma,\type{x}{S_1}\vdash
        \type{M}{T_2}\) is derivable
     3. If \(\Gamma\vdash\type{\rec{\ell_i = M_i \;^{i\in 1\dots
        n}}}{T}\)is derivable, then \(\exists S_1,\dots,S_n \mid
        \Gamma\vdash \type{M_i}{S_i}\) is derivable for each \(i\in
        1\dots n\) and \(\type{\rec{\type{\ell_i}{S_i}\;^{i\in 1 \dots
        n}}}{T}\)
     4. If \(\subt{S}{T_1 \to T_2}\) then \(\exists S_1, S_2\)
        s.t. \(S = S_1 \to S_2\) with \(\subt{T_1}{S_1},
        \subt{S_2}{T_2}\)
     5. If \(\subt{S_1\to S_2}{T}\) then \(\exists T_1, T_2\) s.t. \(T
        = T_1 \to T_2\) with \(\subt{T_1}{S_1}, \subt{S_2}{T_2}\)
     6. If \(\subt{S}{\rec{\type{\ell_i}{T_i}\;^{i\in I}}}\) then
        \(S=\rec{\type{\ell_i}{S_i}\;^{i\in I \cup I'}}\) with
        \(\subt{S_i}{T_i}\) for all \(i \in I\)
     7. If \(\subt{\rec{\type{\ell_i}{S_i}\;^{i\in I}}}{T}\) then
        \(T=\rec{\type{\ell_i}{T_i}\;^{i\in I'}}\) with \(I\subseteq
        I'\) and \(\subt{S_i}{T_i}\) for all \(i \in I\)

*** Canonical form lemma(s)
    1. if \(v\) is a value and \(\emptyset \vdash \type{v}{\Bool}\)
       then \(v\) is either =true= or =false=.
    2. if \(v\) is a value and \(\emptyset \vdash \type{v}{\Nat}\)
       then \(v\) is an integer constant \(n\).
    3. if \(v\) is a value and \(\emptyset \vdash \type{v}{T_1 \to
       T_2}\) then \(v\) is \(\fn{\type{x}{T_1}}{M}\).
    4. if \(v\) is a value and \(\emptyset \vdash \type{v}{\Unit}\) then
       \(v\) is the \(\unit\) value.
    5. if \(v\) is a value and \(\emptyset \vdash \type{v}{T_1 * T_2}\)
       then \(v\) is in the shape \(\pair{v_1}{v_2}\).
    6. if \(v\) is a value and \(\emptyset \vdash
       \type{v}{\rec{\type{\ell_i}{T_i}\quad^{i\in 1 \dots n}}}\) then
       \(v\) is in the shape \(\rec{\ell_i = v_i\quad^{i\in 1 \dots
       n}}\).
    7. if \(v\) is a value and \(\emptyset \vdash
       \type{v}{\var{\type{\ell_i}{T_i}\quad^{i\in 1 \dots n}}}\) then
       \(v\) is in the shape \(\var{\ell_i = v_i}\) with \(i\in 1\dots
       n\).

*** Permutation lemma
    If \(\Gamma\vdash\type{M}{T}\) is a derivable judgment, and
    \(\Delta\) is a permutation of \(\Gamma\), then
    \(\Delta\vdash\type{M}{T}\) is derivable with proof tree of the
    same height.

    The proof works by induction on the height of \(\Gamma\vdash
    \type{M}{T}\).

*** Weakening lemma
    If \(\Gamma\vdash\type{M}{T}\) is a derivable judgment and \(x
    \not\in \Dom (\Gamma)\), then
    \(\Gamma,\type{x}{S}\vdash\type{M}{T}\)

    The proof works by induction on the height of \(\Gamma\vdash
    \type{M}{T}\).

*** Substitution lemma
    If \(\Gamma,\type{x}{S}\vdash\type{M}{T}\) and
    \(\Gamma\vdash\type{N}{S}\), then \(\Gamma \vdash \type{M
    \subs{x}{N}}{T}\)

    The proof works by induction on the height of \(\Gamma,
    \type{x}{S}\vdash \type{M}{T}\).

** Theorems

*** Progress theorem
    Let $M$ be a closed and well-typed term, i.e. \(\emptyset
    \vdash\type{M}{T}\), then either $M$ is a value or \(\exists M'\)
    s.t. \(M\to M'\).

    The proof works by induction on the height of \(\Gamma\vdash
    \type{M}{T}\).
    
*** Subject Reduction or Type Preservation
    If \(\Gamma\vdash\type{M}{T}\) and \(M\to M'\), then \(\Gamma
    \vdash \type{M'}{T}\)

    The proof works by induction on the height of \(M\to M'\).

**** *Corollary*:
     If \(\emptyset\vdash\type{M}{T}\) and \(M \to^* M'\), then
     \(\emptyset\vdash\type{M'}{T}\)
     
*** Safety
    If \(M\) is a closed and well-typed term, then it does not reduce
    to a stuck term. That is, let \(M\) be s.t. \(\emptyset \vdash
    \type{M}{T}\) and \(M\to* M'\) s.t. \(M'\not\to\), then \(M'\) is
    a value

    The proof just works because of the latter theorems.
    
* Extensions
** Unit type
   | M := \(\dots \mid\) unit | \(v := \dots \mid\) unit | \(T := \dots \mid \) Unit | \(\inferr{T-UNIT}{\Gamma \vdash \type{\unit}{\Unit}}{}\) |

   Thanks to the unit type, we can introduce syntactic sugar
   \(M_1;M_2\), which expands to
   \(\app{(\fn{\type{x}{\Unit}}{M_2})}{M_1}\) with \(x\) fresh,
   i.e. \(x\not\in fv(M_2)\)

   We can also optionally introduce the following derivation rules to
   concatenate terms with the new construct:

   | \(\inferr{SEQ}{M_1;M_2 \to M_1';M_2}{M_1 \to M_1'}\) | \(\inferr{SEQ-NEXT}{\unit;M \to M}{}\) |

   \[\inferr{T-SEQ}{\Gamma \vdash \type{M_1;M_2}{T}}{\Gamma \vdash
   \type{M_1}{\Unit} & \Gamma \vdash \type{M_2}{T}}\]

** Pairs
   | <l>   | <c> |                                                                  <r> |
   | \(M\) | :=  | \(\dots \mid \pair{M_1}{M_2} \mid \fst{M_1} \mid \snd{M_1}\) |

   Pairs have a new /product type/: \(T_1 * T_2\), and pairs values
   are in the shape \(v_1, v_2\).

*** Axioms

    | \(\inferr{PAIR-1}{\fst{\pair{v_1}{v_2}} \to v_1}{}\) | \(\inferr{PAIR-2}{\snd{\pair{v_1}{v_2}} \to v_2}{}\) |

