README.org
*** Rules
    
    | \(\inferr{PROJECT-1}{\fst{M} \to \fst{M'}}{M \to M'}\)               | \(\inferr{PROJECT-2}{\snd{M} \to \snd{M'}}{M \to M'}\)           |
    |                                                                              |                                                                          |
    | \(\inferr{EVAL-PAIR-1}{\pair{M_1}{M_2} \to \pair{M_1'}{M_2}}{M_1 \to M_1'}\) | \(\inferr{EVAL-PAIR-2}{\pair{v}{M_2} \to \pair{v}{M_2'}}{M_2 \to M_2'}\) |

*** Typing rules

    \[\inferr{T-PAIR}{\Gamma\vdash\type{\pair{M_1}{M_2}}{T_1 *
    T_2}}{\Gamma\vdash\type{M_1}{T_1} & \Gamma\vdash \type{M_2}{T_2}}\]

    | \(\inferr{T-PROJECT-1}{\Gamma \vdash \type{\fst{M}}{T_1}}{\Gamma\vdash\type{M}{T_1 * T_2}}\) | \(\inferr{T-PROJECT-2}{\Gamma \vdash \type{\snd{M}}{T_2}}{\Gamma\vdash\type{M}{T_1 * T_2}}\) |

** Records

   | <l>   | <c> | <l>                                             |
   | \(M\) | ::= | \(\dots \mid \rec{\ell_i = M_i ^{i \in 1..n}}\) |
   |       |     |                                                 |
   | \(v\) | ::= | \(\dots \mid \rec{\ell_i = v_i ^{i \in 1..n}}\) |
   |       |     |                                                 |
   | \(T\) | ::= | \(\dots \mid \rec{\ell_i : T_i ^{i \in 1..n}}\) |

*** Axioms
    \[\inferr{SELECT}{\sel{\rec{\ell_i = v_i \quad^{i \in
    1..n}}}{\ell_j} \to v_j}{j\in 1..n}\]

*** Rules
    | \(\infer[\text{(EVAL-SELECT) }]{\sel{M}{\ell} \to \sel{M'}{\ell}} {M\to M'}\)                                                                                                                              |
    |                                                                                                                                                                                                            |
    | (EVAL RECORD)                                                                                                                                                                                              |
    | \(\infer{\rec{\ell_i = v_i ^{i\in 1\dots j-1}, \ell_j = M_j, \ell_k = M_k^{k \in j+1 \dots n}} \to \rec{\ell_i = v_i ^{i\in 1\dots j-1}, \ell_j = M_j', \ell_k = M_k^{k \in j+1 \dots n}}}{M_j \to M_j'}\) |

*** Typing rules
    | (T-RECORD)                                                                                                                                                            | (T-SELECT)                                                                                                       |
    |                                                                                                                                                                       |                                                                                                                  |
    | \(\infer{\Gamma\vdash\type{\rec{\ell_i = M_i\quad ^{i\in 1 .. n}}}{\rec{\type{\ell_i}{T_i}\quad^{i\in 1..n}}}}{\forall i \in 1 .. n \quad \Gamma \vdash M_i : T_i} \) | \(\infer{\Gamma\vdash \type{M.\ell_j}{T_j}}{\Gamma\vdash \type{M}{\rec{\type{\ell_i}{T_i}\quad^{i \in 1..n}}}}\) |

    with \(j \in \{1, \dots, n\}\)

** Variant types
   | <l>   | <c> | <l>                                                           |
   | \(M\) | ::= | \(\dots \mid \var{\ell = M}\)                                 |
   |       |     |                                                               |
   | \(v\) | ::= | \(\dots \mid \var{\ell = v}\)                                 |
   |       |     |                                                               |
   | \(T\) | ::= | \(\dots \mid \var{\type{\ell_i}{T_i}^{\quad i\in 1\dots n}}\) |

*** Axioms
    \[\infer{\match{\var{\ell_j =
    v_j}}{\case{\ell_i}{x_i}{M_i}^{\quad i \in 1\dots n}}\to
    M_j\subs{x_j}{v_j}}{\text{(MATCH)}}\]
*** Rules
    - (RED-MATCH) \[\infer{\match{M}{\case{\ell_i}{x_i}{M_i}^{\quad i
      \in 1\dots n}}\to \match{M'}{\case{\ell_i}{x_i}{M_i}^{\quad i
      \in 1\dots n}} }{M\to M'}\]
    - (VARIANT) \[\infer{\var{\ell = M} \to \var{\ell = M'}}{M\to
      M'}\]
*** Typing rules
    - (TYPE-VARIANT) \[\infer[j\in 1 \dots n]{\Gamma \vdash
      \type{\var{\ell_j = M}}{\var{\type{\ell_i}{T_i}^{\quad i \in 1
      \dots n}}}}{\Gamma \vdash \type{M}{T_j}}\]
    - (TYPE-MATCH)
      \[\infer{\Gamma\vdash\match{M}{\case{\ell_i}{x_i}{M_i}^{\quad i
      \in 1\dots n}}}{\Gamma\vdash
      \type{M}{\var{\type{\ell_i}{T_i}^{i\in 1\dots n}}} & \forall i
      \in 1 \dots n\quad \Gamma, \type{x_i}{T_i}\vdash
      \type{M_i}{T}}\]

** Subtyping
   No terms, values or types are added, justo new rules to embed the
   concept of /subtyping/
*** Axioms
    (REFLEX) \[\infer{\subt{T}{T}}{}\]
*** Rules
    The main rule added is (SUBSUMPTION), it allows for generic
    subtyping. Attention! with this rule we loss the unicity of
    typing!

    | \(\inferr{SUBSUMPTION}{\Gamma\vdash \type{M}{T}}{\Gamma \vdash \type{M}{T} & \subt{S}{T}}\) | \(\inferr{TRANS}{\subt{S}{T}}{\subt{S}{U} & \subt{U}{T}}\) |
    
*** Record-sepcific rules
    We're introducing record-specific rules, since is the data
    structures which allows us to encode sort of /objects/ into our
    language

    - (SUB-WIDTH) \[\infer{\subt{\rec{\type{\ell_i}{T_i}^{\quad i \in
      I\cup I'}}}{\rec{\type{\ell_i}{T_i}^{\quad i \in I}}}}{}\]
    - (SUB-DEPTH) \[\infer{ \subt{ \rec{ \type{\ell_i}{S_i}^{\quad i
      \in I}}}{\rec{\type{\ell_i}{T_i}^{\quad i \in I}}}}
      {\subt{S_i}{T_i}\quad \forall i \in I}\]
** Exceptions
   | <l>   | <c> | <l>                                         |
   | \(M\) | ::= | \(\dots \mid \throw{M} \mid \tc{M_1}{M_2}\) |

*** Axioms
    - (TRY-VAL) \[\infer{\tc{v}{M}\to v}{}\]
    - (RAISE-2) \[\infer{\throw{\throw{v}} \to v}{}\]
    - (RIASE APP 1) \[\infer{\app{\throw{v}}{M} \to \throw{v}}{}\]
    - (RIASE APP 2) \[\infer{\app{v_1}{\throw{v_2}} \to
      \throw{v_2}}{}\]
    - (RIASE IF-THEN-ELSE) \[\infer{\ifc{\throw{v}}{M}{N}\to
      \throw{v}}{}\]
    - (RAISE SUM 1) \[\infer{\throw{v} + M \to \throw{v}}{}\]
    - (RAISE SUM 2) \[\infer{v_1 + \throw{v_2} \to \throw{v_2}}{}\]
*** Rules
    - (TRY) \[\infer{\tc{M}{N} \to \tc{M'}{N}}{M\to M'}\]
    - (RAISE 1) \[\infer{\throw{M} \to \throw{M'}}{M\to M'}\]
*** Typing rules
    - (T RAISE) \[\infer{\Gamma\vdash \type{\throw{M}}{T}}
      {\Gamma\vdash \type{M}{T_{exn}}}\]
    - (T RAISE)
      \[\infer{\Gamma\vdash\type{\tc{M}{N}}{T}}{\Gamma\vdash\type{M}{T}
      & \Gamma\vdash \type{N}{(T_{exn}\to T)}}\]
** Featherweight Java
   |                       <r> | <c> | <l>                                               |
   |      Class declaration CL | ::= | class C extends D { A~ f; K M~ }                  |
   |                           |     |                                                   |
   | Constructor Declaration K | ::= | C(A~ g, B~ f) { super($g~$); this.f~ = f~ }       |
   |                           |     |                                                   |
   |      Method Declaration M | ::= | C m(A~ x) { return t; }                           |

   |         <r> | <c> | <l>         | <l>               |                             <r> |
   | Terms \(t\) | ::= | x           | variables         |                                 |
   |             |     | \(t\).f     | field selection   |                                 |
   |             |     | \(t\).m(t*) | method invocation | Values \(u,v ::=\) new C(\(v\)) |
   |             |     | new C(t*)   | object creation   |                                 |
   |             |     | \((C)t\)    | cast              |                                 |
   
