README.tex

\subsubsection*{Rules}
\label{sec:orgd9ba473}

\begin{center}
\begin{tabular}{ll}
\(\inferr{PROJECT-1}{\fst{M} \to \fst{M'}}{M \to M'}\) & \(\inferr{PROJECT-2}{\snd{M} \to \snd{M'}}{M \to M'}\)\\
 & \\
\(\inferr{EVAL-PAIR-1}{\pair{M_1}{M_2} \to \pair{M_1'}{M_2}}{M_1 \to M_1'}\) & \(\inferr{EVAL-PAIR-2}{\pair{v}{M_2} \to \pair{v}{M_2'}}{M_2 \to M_2'}\)\\
\end{tabular}

\end{center}

\subsubsection*{Typing rules}
\label{sec:orgeab0869}

\[\inferr{T-PAIR}{\Gamma\vdash\type{\pair{M_1}{M_2}}{T_1 *
    T_2}}{\Gamma\vdash\type{M_1}{T_1} & \Gamma\vdash \type{M_2}{T_2}}\]

\begin{center}
\begin{tabular}{ll}
\(\inferr{T-PROJECT-1}{\Gamma \vdash \type{\fst{M}}{T_1}}{\Gamma\vdash\type{M}{T_1 * T_2}}\) & \(\inferr{T-PROJECT-2}{\Gamma \vdash \type{\snd{M}}{T_2}}{\Gamma\vdash\type{M}{T_1 * T_2}}\)\\
\end{tabular}

\end{center}

\subsection*{Records}
\label{sec:org1e79f67}

\begin{center}
\begin{tabular}{lcl}
\(M\) & ::= & \(\dots \mid \rec{\ell_i = M_i ^{i \in 1..n}}\)\\
 &  & \\
\(v\) & ::= & \(\dots \mid \rec{\ell_i = v_i ^{i \in 1..n}}\)\\
 &  & \\
\(T\) & ::= & \(\dots \mid \rec{\ell_i : T_i ^{i \in 1..n}}\)\\
\end{tabular}

\end{center}

\subsubsection*{Axioms}
\label{sec:org724ab5d}
\[\inferr{SELECT}{\sel{\rec{\ell_i = v_i \quad^{i \in
    1..n}}}{\ell_j} \to v_j}{j\in 1..n}\]

\subsubsection*{Rules}
\label{sec:org3432229}
\begin{center}
\begin{tabular}{l}
\(\infer[\text{(EVAL-SELECT) }]{\sel{M}{\ell} \to \sel{M'}{\ell}} {M\to M'}\)\\
\\
(EVAL RECORD)\\
\(\infer{\rec{\ell_i = v_i ^{i\in 1\dots j-1}, \ell_j = M_j, \ell_k = M_k^{k \in j+1 \dots n}} \to \rec{\ell_i = v_i ^{i\in 1\dots j-1}, \ell_j = M_j', \ell_k = M_k^{k \in j+1 \dots n}}}{M_j \to M_j'}\)\\
\end{tabular}

\end{center}

\subsubsection*{Typing rules}
\label{sec:orgc5c1e22}
\begin{center}
\begin{tabular}{ll}
(T-RECORD) & (T-SELECT)\\
 & \\
\(\infer{\Gamma\vdash\type{\rec{\ell_i = M_i\quad ^{i\in 1 .. n}}}{\rec{\type{\ell_i}{T_i}\quad^{i\in 1..n}}}}{\forall i \in 1 .. n \quad \Gamma \vdash M_i : T_i}\) & \(\infer{\Gamma\vdash \type{M.\ell_j}{T_j}}{\Gamma\vdash \type{M}{\rec{\type{\ell_i}{T_i}\quad^{i \in 1..n}}}}\)\\
\end{tabular}

\end{center}

with \(j \in \{1, \dots, n\}\)

\subsection*{Variant types}
\label{sec:orgacb4f53}
\begin{center}
\begin{tabular}{lcl}
\(M\) & ::= & \(\dots \mid \var{\ell = M}\)\\
 &  & \\
\(v\) & ::= & \(\dots \mid \var{\ell = v}\)\\
 &  & \\
\(T\) & ::= & \(\dots \mid \var{\type{\ell_i}{T_i}^{\quad i\in 1\dots n}}\)\\
\end{tabular}

\end{center}

\subsubsection*{Axioms}
\label{sec:orgf6c0af2}
\[\infer{\match{\var{\ell_j =
    v_j}}{\case{\ell_i}{x_i}{M_i}^{\quad i \in 1\dots n}}\to
    M_j\subs{x_j}{v_j}}{\text{(MATCH)}}\]
\subsubsection*{Rules}
\label{sec:org3de8fb5}
\begin{itemize}
\item (RED-MATCH) \[\infer{\match{M}{\case{\ell_i}{x_i}{M_i}^{\quad i
      \in 1\dots n}}\to \match{M'}{\case{\ell_i}{x_i}{M_i}^{\quad i
      \in 1\dots n}} }{M\to M'}\]
\item (VARIANT) \[\infer{\var{\ell = M} \to \var{\ell = M'}}{M\to
      M'}\]
\end{itemize}
\subsubsection*{Typing rules}
\label{sec:org9a9f59a}
\begin{itemize}
\item (TYPE-VARIANT) \[\infer[j\in 1 \dots n]{\Gamma \vdash
      \type{\var{\ell_j = M}}{\var{\type{\ell_i}{T_i}^{\quad i \in 1
      \dots n}}}}{\Gamma \vdash \type{M}{T_j}}\]
\item (TYPE-MATCH)
\[\infer{\Gamma\vdash\match{M}{\case{\ell_i}{x_i}{M_i}^{\quad i
      \in 1\dots n}}}{\Gamma\vdash
      \type{M}{\var{\type{\ell_i}{T_i}^{i\in 1\dots n}}} & \forall i
      \in 1 \dots n\quad \Gamma, \type{x_i}{T_i}\vdash
      \type{M_i}{T}}\]
\end{itemize}

\subsection*{Subtyping}
\label{sec:org94436cc}
No terms, values or types are added, justo new rules to embed the
concept of \emph{subtyping}
\subsubsection*{Axioms}
\label{sec:org9436b20}
(REFLEX) \[\infer{\subt{T}{T}}{}\]
\subsubsection*{Rules}
\label{sec:org32d7f76}
The main rule added is (SUBSUMPTION), it allows for generic
subtyping. Attention! with this rule we loss the unicity of
typing!

\begin{center}
\begin{tabular}{ll}
\(\inferr{SUBSUMPTION}{\Gamma\vdash \type{M}{T}}{\Gamma \vdash \type{M}{T} & \subt{S}{T}}\) & \(\inferr{TRANS}{\subt{S}{T}}{\subt{S}{U} & \subt{U}{T}}\)\\
\end{tabular}

\end{center}

\subsubsection*{Record-sepcific rules}
\label{sec:org4152d5e}
We're introducing record-specific rules, since is the data
structures which allows us to encode sort of \emph{objects} into our
language

\begin{itemize}
\item (SUB-WIDTH) \[\infer{\subt{\rec{\type{\ell_i}{T_i}^{\quad i \in
      I\cup I'}}}{\rec{\type{\ell_i}{T_i}^{\quad i \in I}}}}{}\]
\item (SUB-DEPTH) \[\infer{ \subt{ \rec{ \type{\ell_i}{S_i}^{\quad i
      \in I}}}{\rec{\type{\ell_i}{T_i}^{\quad i \in I}}}}
      {\subt{S_i}{T_i}\quad \forall i \in I}\]
\end{itemize}
\subsection*{Exceptions}
\label{sec:org07a8be7}
\begin{center}
\begin{tabular}{lcl}
\(M\) & ::= & \(\dots \mid \throw{M} \mid \tc{M_1}{M_2}\)\\
\end{tabular}

\end{center}

\subsubsection*{Axioms}
\label{sec:org95db2da}
\begin{itemize}
\item (TRY-VAL) \[\infer{\tc{v}{M}\to v}{}\]
\item (RAISE-2) \[\infer{\throw{\throw{v}} \to v}{}\]
\item (RAISE APP 1) \[\infer{\app{\throw{v}}{M} \to \throw{v}}{}\]
\item (RAISE APP 2) \[\infer{\app{v_1}{\throw{v_2}} \to
      \throw{v_2}}{}\]
\item (RAISE IF-THEN-ELSE) \[\infer{\ifc{\throw{v}}{M}{N}\to
      \throw{v}}{}\]
\item (RAISE SUM 1) \[\infer{\throw{v} + M \to \throw{v}}{}\]
\item (RAISE SUM 2) \[\infer{v_1 + \throw{v_2} \to \throw{v_2}}{}\]
\end{itemize}
\subsubsection*{Rules}
\label{sec:org4bc0b88}
\begin{itemize}
\item (TRY) \[\infer{\tc{M}{N} \to \tc{M'}{N}}{M\to M'}\]
\item (RAISE 1) \[\infer{\throw{M} \to \throw{M'}}{M\to M'}\]
\end{itemize}
\subsubsection*{Typing rules}
\label{sec:org568c11d}
\begin{itemize}
\item (T RAISE) \[\infer{\Gamma\vdash \type{\throw{M}}{T}}
      {\Gamma\vdash \type{M}{T_{exn}}}\]
\item (T RAISE)
\[\infer{\Gamma\vdash\type{\tc{M}{N}}{T}}{\Gamma\vdash\type{M}{T}
      & \Gamma\vdash \type{N}{(T_{exn}\to T)}}\]
\end{itemize}
\subsection*{Featherweight Java}
\label{sec:orgb3c980b}
\begin{center}
\begin{tabular}{rcl}
Class declaration CL & ::= & class C extends D \{ A\textasciitilde{} f; K M\textasciitilde{} \}\\
 &  & \\
Constructor Declaration K & ::= & C(A\textasciitilde{} g, B\textasciitilde{} f) \{ super(\(g~\)); this.f\textasciitilde{} = f\textasciitilde{} \}\\
 &  & \\
Method Declaration M & ::= & C m(A\textasciitilde{} x) \{ return t; \}\\
\end{tabular}

\end{center}

\begin{center}
\begin{tabular}{rcllr}
Terms \(t\) & ::= & x & variables & \\
 &  & \(t\).f & field selection & \\
 &  & \(t\).m(t*) & method invocation & Values \(u,v ::=\) new C(\(v\))\\
 &  & new C(t*) & object creation & \\
 &  & \((C)t\) & cast & \\
\end{tabular}

\end{center}
\end{document}
